# ch06 (1)

top100-kdrama.csv 파일을 DF로 읽어, nan값이 들어 있는 컬럼을 모두 제거한 DataFrame을 만들고 출력하라.

In [1]:
import pandas as pd

In [10]:
df = pd.read_csv("실습데이터/ch06/top100_kdrama.csv")

In [11]:
df_cleaned = df.dropna(axis=1)
print(df_cleaned)

                             Name  Year of release  \
0                  Move to Heaven             2021
1               Hospital Playlist             2020
2                  Flower of Evil             2020
3             Hospital Playlist 2             2021
4                       My Mister             2018
..                            ...              ...
95                       Vagabond             2019
96                    Doctor John             2019
97       When the Camellia Blooms             2019
98  Because This Is My First Life             2017
99               Fight For My Way             2017

                     Aired Date              Aired On  Number of Episode  \
0                     14-May-21                Friday                 10
1   Mar 12, 2020 - May 28, 2020              Thursday                 12
2   Jul 29, 2020 - Sep 23, 2020   Wednesday, Thursday                 16
3   Jun 17, 2021 - Sep 16, 2021              Thursday                 12
4   Mar 21, 2018 - May 17, 2018   Wednesday, Thursday                 16
..                          ...                   ...                ...
95  Sep 20, 2019 - Nov 23, 2019      Friday, Saturday                 16
96  Jul 19, 2019 - Sep  7, 2019      Friday, Saturday                 32
97  Sep 18, 2019 - Nov 21, 2019   Wednesday, Thursday                 40
98  Oct  9, 2017 - Nov 28, 2017       Monday, Tuesday                 16
99  May 22, 2017 - Jul 11, 2017       Monday, Tuesday                 16

            Network       Duration                          Content Rating  \
0          Netflix         52 min.  18+ Restricted (violence & profanity)
1    Netflix,  tvN   1 hr. 30 min.                15+ - Teens 15 or older
2              tvN   1 hr. 10 min.                15+ - Teens 15 or older
3    Netflix,  tvN   1 hr. 40 min.                15+ - Teens 15 or older
4              tvN   1 hr. 17 min.                15+ - Teens 15 or older
..              ...            ...                                     ...
95   Netflix,  SBS   1 hr. 10 min.                15+ - Teens 15 or older
96             SBS         35 min.                15+ - Teens 15 or older
97  KBS2,  Netflix         35 min.                15+ - Teens 15 or older
98             tvN   1 hr. 10 min.                15+ - Teens 15 or older
99            KBS2         60 min.                15+ - Teens 15 or older

                                             Synopsis  \
0   Geu Roo is a young autistic man. He works for ...
1   The stories of people going through their days...
2   Although Baek Hee Sung is hiding a dark secret...
3   Everyday is extraordinary for five doctors and...
4   Park Dong Hoon is a middle-aged engineer who i...
..                                                ...
95  Cha Dal Gun becomes an awakened tiger in the f...
96  ?쏡octor John??is a medical drama about doctors...
97  Dong Baek is a single mother living in the sma...
98  A house-poor man and homeless woman become hou...
99  Can you still go after your dreams without the...

                                                 Cast  \
0   Lee Je Hoon, Tang Jun Sang, Hong Seung Hee, Ju...
1   Jo Jung Suk, Yoo Yeon Seok, Jung Kyung Ho, Kim...
2   Lee Joon Gi, Moon Chae Won, Jang Hee Jin, Seo ...
3   Jo Jung Suk, Yoo Yeon Seok, Jung Kyung Ho, Kim...
4   Lee Sun Kyun, IU, Park Ho San, Song Sae Byuk, ...
..                                                ...
95  Lee Seung Gi, Bae Suzy, Shin Sung Rok, Baek  Y...
96  Ji Sung, Lee Se Young, Lee Kyu Hyung, Hwang He...
97  Gong Hyo Jin, Kang Ha Neul, Kim Ji Suk, Son Da...
98  Jung So Min, Lee Min Ki, Esom, Park Byung Eun,...
99  Park Seo Joon, Kim Ji Won, Ahn Jae Hong, Song ...

                                            Genre  \
0                          Life,  Drama,  Family
1          Friendship,  Romance,  Life,  Medical
2         Thriller,  Romance,  Crime,  Melodrama
3          Friendship,  Romance,  Life,  Medical
4          Psychological,  Life,  Drama,  Family
..                                            ...
95           Action,  Thriller,  Mystery,  Crime
96            Mystery,  Romance,  Life,  Medical
97  Thriller,  Comedy,  Romance,  Drama,  Family
98               Comedy,  Romance,  Life,  Drama
99          Business,  Comedy,  Romance,  Sports

                                                 Tags  Rank Rating
0   Autism, Uncle-Nephew Relationship, Death, Sava...    #1    9.2
1   Strong Friendship, Multiple Mains, Best Friend...    #2    9.1
2   Married Couple, Deception, Suspense, Family Se...    #3    9.1
3   Workplace, Strong Friendship, Best Friends, Mu...    #4    9.1
4   Age Gap, Nice Male Lead, Strong Female Lead, H...    #5    9.1
..                                                ...   ...    ...
95  Plane Crash, Revenge, National Intelligence Se...   #96    8.5
96  Smart Male Lead, Incurable Disease, Eccentric ...   #97    8.5
97  Single Mother, Mystery, Motherhood, Serial Kil...   #98    8.5
98  Contract Relationship, Marriage Of Convenience...   #99    8.5
99  Childhood Friends, Friends To Lovers, Strong M...  #100    8.5

[100 rows x 14 columns]

# ch06 (2) transform

top100-kdrama.csv 파일을 DF로 읽어 출시연도별 Rating 평균값으로  Rating2  컬럼을 추가하고, 출시연도, 이름,  Rating, Rating2 컬럼을 출력하라.

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("실습데이터/ch06/top100_kdrama.csv")

In [9]:
df['Rating'] = pd.to_numeric(df['Rating'])

rating_by_year = df.groupby('Year of release')['Rating'].mean()

df['Rating2'] = df['Year of release'].map(rating_by_year)

result = df[['Year of release', 'Name', 'Rating', 'Rating2']]
print(result)

    Year of release                           Name  Rating   Rating2
0              2021                 Move to Heaven     9.2  8.810526
1              2020              Hospital Playlist     9.1  8.756250
2              2020                 Flower of Evil     9.1  8.756250
3              2021            Hospital Playlist 2     9.1  8.810526
4              2018                      My Mister     9.1  8.790000
..              ...                            ...     ...       ...
95             2019                       Vagabond     8.5  8.646667
96             2019                    Doctor John     8.5  8.646667
97             2019       When the Camellia Blooms     8.5  8.646667
98             2017  Because This Is My First Life     8.5  8.662500
99             2017               Fight For My Way     8.5  8.662500

[100 rows x 4 columns]

# ch06 (3) category, cut

In [1]:
import pandas as pd

In [5]:
data = {
    'Name': ['Hong', 'Kim', 'Lee', 'Park', 'Choi', 'James'],
    'Record': [88, 92, 96, 70, 82, 55]
}
df = pd.DataFrame(data)

bins = [0, 60, 70, 80, 90, 100]
labels = ['F', 'D', 'C', 'B', 'A']


df['Grade'] = pd.cut(df['Record'], bins=bins, labels=labels, right=True)


df['Grade'] = df['Grade'].astype('category')

print(df)

    Name  Record Grade
0   Hong      88     B
1    Kim      92     A
2    Lee      96     A
3   Park      70     D
4   Choi      82     B
5  James      55     F

# 4/15 실습

In [24]:
import pandas as pd
import os
import matplotlib.pyplot as plt
import numpy as np

import seaborn as sns
sns.set(style="whitegrid", color_codes=True)

DATA_DIR = '실습데이터/ch06/타이타닉'
os.listdir(DATA_DIR)

data_files = sorted([os.path.join(DATA_DIR, filename)
for filename in os.listdir(DATA_DIR)], reverse=True)

df_list = []
for filename in data_files:
    df_list.append(pd.read_csv(filename))
    
# (2) 두 개의 데이터프레임을 하나로 통합
df = pd.concat(df_list, sort=False)

# (3) 인덱스 초기화
df = df.reset_index(drop=True)

# (4) 결과 출력
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
df.isna().sum()/len(df)

PassengerId    0.000000
Survived       0.319328
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.200917
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000764
Cabin          0.774637
Embarked       0.001528
dtype: float64

In [26]:
df[df['Age'].notna()].groupby("Sex")['Age'].mean()

Sex
female    28.687088
male      30.585228
Name: Age, dtype: float64

In [27]:
df.groupby("Sex")['Age'].transform("mean")

0       30.585228
1       28.687088
2       28.687088
3       28.687088
4       30.585228
          ...
1304    30.585228
1305    28.687088
1306    30.585228
1307    30.585228
1308    30.585228
Name: Age, Length: 1309, dtype: float64

# ch06 (3)

타이타닉 데이터에서  Age 값이  null 인 것을 SibSp 수별로 그룹화하여 구한 age 의 평균값으로 대체해서 df2를 만들고, df2 전체의 age 의 평균을 출력하라.

In [28]:
age_means_by_sibsp = df.groupby('SibSp')['Age'].mean()

df2 = df.copy()
df2['Age'] = df2['Age'].fillna(df2.groupby('SibSp')['Age'].transform('mean'))

print("전체 평균 나이:", df2['Age'].mean())

전체 평균 나이: 29.915573212828594